<a href="https://colab.research.google.com/github/umutguder/Pandas_Basics/blob/main/Pandas_Unforgettable.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Pandas:**
*   an open source data analysis and manipulation tool, built on top of the Python.
*   can import data from various file formats (JSON, SQL, Microsoft Excel ...)
*   a column-oriented data analysis API. 
*   many ML frameworks support pandas data structures as inputs. 

**Pandas** provides some sets of tools like DataFrame and Series.

**NumPy** offers an object called Array.

In [ ]:
# import the pandas API
import pandas as pd

# Prints the API version
pd.__version__

'1.1.5'

# **Pandas Data Structures**

* **Series**, a single column or one dimensional labeled array capable of holding any data type.
* **DataFrame**, a relational data table, with rows and named columns.
   * A two dimensional labeled data structure with columns of different types
   * **DataFrame** contains one or more **Series** and a name for each Series.

In [30]:
# Series

citySeries = pd.Series(['Istanbul', 'Izmir','Antalya'])
citySeriesWithGivenIndex = pd.Series(['Istanbul', 'Izmir', 'Antalya'], index=[ 'a', 'b','c'])

populationSeries = pd.Series([18000000, 4000000, 1000000])

# Data Frames

cityFrame = pd.DataFrame({ 'City Name': citySeries, 'Population': populationSeries })

In [31]:
# help(pd.Series)  Asking for Help 

# (rows,columns)
cityFrame.shape

(3, 2)

In [26]:
# index
cityFrame.index

RangeIndex(start=0, stop=3, step=1)

In [27]:
# DataFrame columns
cityFrame.columns

Index(['City Name', 'Population'], dtype='object')

In [28]:
# Info on DataFrame
cityFrame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City Name   3 non-null      object
 1   Population  3 non-null      int64
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [29]:
# Number of non-NA values
cityFrame.count()

City Name     3
Population    3
dtype: int64

In [ ]:
cityFrame.sum()

City Name     IstanbulIzmirAntalya
Population                23000000
dtype: object

In [ ]:
cityFrame.min()

City Name     Antalya
Population    1000000
dtype: object

In [ ]:
cityFrame.describe()

         Population
count  3.000000e+00
mean   7.666667e+06
std    9.073772e+06
min    1.000000e+06
25%    2.500000e+06
50%    4.000000e+06
75%    1.100000e+07
max    1.800000e+07

In [ ]:
cityFrame.mean()

Population    7.666667e+06
dtype: float64

In [ ]:
cityFrame.median()

Population    4000000.0
dtype: float64

In [ ]:
print(type(cityFrame['City Name']))

<class 'pandas.core.series.Series'>

In [ ]:
cityFrame['City Name']

0    Istanbul
1       Izmir
2     Antalya
Name: City Name, dtype: object

In [ ]:
cityFrame[0:1]

  City Name  Population
0  Istanbul    18000000

In [ ]:
# Copy and edit
copyCitySeries = citySeries.copy()

copyCitySeries = 'City of ' + copyCitySeries;
copyCitySeries

0    City of Istanbul
1       City of Izmir
2     City of Antalya
dtype: object

In [ ]:
# Dropping from Series
copyCitySeriesWithGivenIndex = citySeriesWithGivenIndex.copy()
dropped = copyCitySeriesWithGivenIndex.drop('a');
dropped

b      Izmir
c    Antalya
dtype: object

In [ ]:
# Series filtering 
filteredPopulationSeries = populationSeries.apply(lambda val: val > 1000000)
filteredPopulationSeries

0     True
1     True
2    False
dtype: bool

In [47]:
 populationData = { 'Country' : [ 'Turkey' ,'U.S' ,'TRNC' ],

 'Capital': [ 'Ankara', 'Washington, DC' , 'Lefkose'],

'Population' : [4000000, 692000, 70000]}

 populationFrame = pd.DataFrame(populationData,columns=[ 'Country', 'Capital','Population' ])
 populationFrame

  Country         Capital  Population
0  Turkey          Ankara     4000000
1     U.S  Washington, DC      692000
2    TRNC         Lefkose       70000

In [48]:
 # Dropping from Frame
 copyPopulationFrame = populationFrame.copy()

 droppedCopyPopulationFrame = copyPopulationFrame.drop('Country' , axis=1) 
 droppedCopyPopulationFrame

          Capital  Population
0          Ankara     4000000
1  Washington, DC      692000
2         Lefkose       70000

In [49]:
#Sort by labels along an axis 
droppedCopyPopulationFrame.sort_index()

          Capital  Population
0          Ankara     4000000
1  Washington, DC      692000
2         Lefkose       70000

In [50]:
# Sort by values along by an axis
copyPopulationFrame.sort_values(by= 'Country')

  Country         Capital  Population
2    TRNC         Lefkose       70000
0  Turkey          Ankara     4000000
1     U.S  Washington, DC      692000

In [51]:
# Assign sort ranks
copyPopulationFrame.rank()

   Country  Capital  Population
0      2.0      1.0         3.0
1      3.0      3.0         2.0
2      1.0      2.0         1.0

# **Read and Write to CSV**

 Write: copyPopulationFrame.to_csv ('theDataFrame.csv')

In [52]:
 #Read:
 
 adresses = pd.read_csv( 'https://people.sc.fsu.edu/~jburkardt/data/csv/addresses.csv', sep=',')
 
 adresses

 # Use adresses.head to print limitted summary of the table

                    John       Doe  ...   NJ  08075
0                   Jack  McGinnis  ...   PA   9119
1          John "Da Man"    Repici  ...   NJ   8075
2                Stephen     Tyler  ...   SD  91234
3                    NaN  Blankman  ...   SD    298
4  Joan "the bone", Anne       Jet  ...   CO    123

[5 rows x 6 columns]

In [ ]:
# Read and Write to Excel
# pd.read_excel('file.xls')
# df.to_excel('file.xls' , sheet_name='Sheet1' )

# **# Read and Write to SQL Query or Database Table**

In [53]:
from sqlalchemy import create_engine

engine = create_engine('sqlite:///:umut:')

# Create table
adresses.to_sql("adresses", engine, if_exists="replace")
# Read Table 
pd.read_sql( 'SELECT * FROM adresses;', engine)

   index                   John       Doe  ...    Riverside   NJ  08075
0      0                   Jack  McGinnis  ...        Phila   PA   9119
1      1          John "Da Man"    Repici  ...    Riverside   NJ   8075
2      2                Stephen     Tyler  ...     SomeTown   SD  91234
3      3                   None  Blankman  ...     SomeTown   SD    298
4      4  Joan "the bone", Anne       Jet  ...  Desert City   CO    123

[5 rows x 7 columns]

# **Selecting By Position **

In [54]:
#Select single value by row & column
adresses.iloc[[0],[0]]

   John
0  Jack

In [55]:
cityFrame.loc[[0], ['City Name']]

  City Name
0  Istanbul

In [56]:
# Boolean Indexing
cityFrame[cityFrame['Population']>5000000]

  City Name  Population
0  Istanbul    18000000

In [57]:
# Applying Functions

f = lambda x: x*2

cityFrame.apply(f)
cityFrame.applymap(f)

          City Name  Population
0  IstanbulIstanbul    36000000
1        IzmirIzmir     8000000
2    AntalyaAntalya     2000000